# Ejercicio 1
Utiliza el conjunto de datos adult.csv y ejecuta los códigos que se muestran en las siguientes capturas de pantalla. Luego responde las preguntas.

In [ ]:
import pandas as pd
import numpy as np
adult_df = pd.read_csv('adult.csv')
adult_df.set_index(np.arange(10000,42561),inplace=True)


print(adult_df.iloc[5:7,0:2])

print(adult_df.loc['10005':'10007','age':'fnlwgt'])

adult_df

       age workclass
10005   37   Private
10006   49   Private
       age         workclass  fnlwgt
10005   37           Private  284582
10006   49           Private  160187
10007   52  Self-emp-not-inc  209642

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
10000,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
10001,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
10002,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
10003,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
10004,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
42556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
42557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
42558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
42559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
42560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

- Utiliza la salida para responder cuál es la diferencia en el comportamiento de .loc e .iloc cuando se trata de cortar.

- Sin ejecutar, pero solo mirando los datos, ¿cuál será la salida de adult_df.loc['10000':'10003', 'relationship':'sex']?

- Sin ejecutar, pero solo mirando los datos, ¿cuál será la salida de adult_df.iloc[0:3, 7:9]?

In [16]:
#Loc incluye el ultimo indice, iloc no, ademas loc se llama con el nombre de la etiqueta, a diferencia de iloc, y loc soporta condiciones booleanas o de verdadero o falso, iloc no.

#Salida loc ↓
#         relationship	race	sex
# 10000	Not-in-family	White	Male
# 10001	Husband	        White	Male
# 10002	Not-in-family	White	Male
# 10003	Husband	        Black	Male

#Salida iloc ↓
#         relationship	race	
# 10000	Not-in-family	White	
# 10001	Husband	        White	
# 10002	Not-in-family	White

# Ejercicio 2
Para adult_df usa la función .groupby() para ejecutar el siguiente código y crear la serie de índices múltiples mlt_sr.

In [20]:
import pandas as pd

adult_df = pd.read_csv('adult.csv')
mlt_seris =adult_df.groupby(['race','sex','income']).fnlwgt.mean()
mlt_seris

race                sex     income
Amer-Indian-Eskimo  Female  <=50K     109018.626168
                            >50K      148012.000000
                    Male    <=50K     126428.767857
                            >50K      120721.541667
Asian-Pac-Islander  Female  <=50K     148165.333333
                            >50K      142426.093023
                    Male    <=50K     163885.130435
                            >50K      170698.347639
Black               Female  <=50K     213411.580205
                            >50K      205806.033333
                    Male    <=50K     242343.990566
                            >50K      245390.356902
Other               Female  <=50K     173235.932039
                            >50K      160223.333333
                    Male    <=50K     214891.832168
                            >50K      204551.736842
White               Female  <=50K     183485.120961
                            >50K      184030.255837
                    Male    <=50K     189950.465418
                            >50K      186917.770077
Name: fnlwgt, dtype: float64

Ahora que has creado una serie de índices múltiples, ejecuta los siguientes códigos, estudia las salidas y responde las preguntas.

- Ejecuta el código a continuación primero y luego responde lo siguiente. Cuando usamos .iloc[] para una serie o DataFrame de índices múltiples, ¿qué deberíamos esperar?

In [21]:
print(mlt_seris.iloc[0])
print(mlt_seris.iloc[1])
print(mlt_seris.iloc[2])

109018.6261682243
148012.0
126428.76785714286

In [ ]:
# El resultado o valor de la serie. En este caso la media de la columna fnlwgt, que son floats.

<class 'numpy.float64'>

- Ejecuta el código a continuación primero y luego responde lo siguiente. Cuando usamos .loc[] para acceder a los datos de uno de los niveles de índice más internos de la serie de índices múltiples, ¿qué deberíamos esperar?

In [ ]:
mlt_seris.loc['Other']

<class 'pandas.core.series.Series'>

In [ ]:
# La serie o subserie resultante, incluyendo los sub indices de other en este caso.

- Ejecuta los códigos a continuación primero y luego responde lo siguiente. Cuando usamos .loc[] para acceder a los datos de uno de los niveles de índice no más internos de la serie de índices múltiples, ¿qué deberíamos esperar?

Cuando ejecutes cualquiera de las líneas de código a continuación, obtendrás un error y ese es el punto de esta pregunta. Estudia el error e intenta responder la pregunta.

In [ ]:
mlt_seris.loc[:,'Female'] 
#Da error porque 'Female' no es un indice, sino un subindice de la serie. 
# hay que especificar los indices anteriores para acceder a los subindices.

race                income
Amer-Indian-Eskimo  <=50K     109018.626168
                    >50K      148012.000000
Asian-Pac-Islander  <=50K     148165.333333
                    >50K      142426.093023
Black               <=50K     213411.580205
                    >50K      205806.033333
Other               <=50K     173235.932039
                    >50K      160223.333333
White               <=50K     183485.120961
                    >50K      184030.255837
Name: fnlwgt, dtype: float64

In [ ]:
mlt_seris.loc[('Black', 'Female', '<=50K')]
#Lo mismo pero en este caso al ser de 3er nivel, hay que nombrar cada uno de los indices
# anteriores, en este caso 'Black' y Female, como si de una ruta se tratase.

213411.58020477815

- Ejecuta los códigos a continuación primero y luego responde lo siguiente. ¿En qué se diferencia el uso de .loc[] o .iloc[] cuando se trabaja con una serie de índices múltiples o un DataFrame?

In [ ]:
print(mlt_seris.loc['Other']['Female']['<=50K'])
print(mlt_seris.iloc[12])

173235.93203883496
173235.93203883496

# Ejercicio 3
Para este ejercicio, debe utilizar un nuevo conjunto de datos: billboard.csv. Visite https://www.billboard.com/charts/hot-100 y vea las clasificaciones de canciones más recientes del día. Este conjunto de datos presenta información y clasificación de 317 pistas de canciones en 80 columnas. Las primeras cuatro columnas son artista, pista, hora y date_e. Las primeras columnas son descripciones intuitivas de las pistas de canciones. La columna date_e muestra la fecha en que las canciones ingresaron a la lista hot-100. Las 76 columnas restantes son las clasificaciones de canciones al final de cada semana desde 'w1' hasta 'w76'. Descargue y lea este conjunto de datos con pandas y responda las siguientes preguntas.

- Escribe una línea de código que te dé una gran idea de cuántos valores nulos tiene cada columna. Si hay alguna columna que no tenga valores no nulos, elimínala.

- Con un bucle for, dibuja y estudia los valores en cada una de las columnas W restantes.

- El conjunto de datos está en formato ancho, usa una función apropiada para cambiar a un formato largo y nombra el dataframe fundido mlt_df.

- Escribe un código que muestre mlt_df cada 1200 filas.

- Ejecuta el siguiente código primero y responde la pregunta. ¿Podrías haber hecho esto usando también el enmascaramiento booleano?

In [ ]:
mlt_df.query('artist == "Spears, Britney"')

¿Se podría haber hecho esto utilizando también el enmascaramiento booleano?

Answer:

- Utiliza el enfoque en e o la máscara booleana para extraer todas las canciones únicas que Britney Spears tiene en este conjunto de datos.

- En mlt_df muestra todas las semanas que la canción "Oops!.. I Did It Again" estuvo en el top-100

# Ejercicio 4

Para este ejercicio, utilizaremos LaqnData.csv. Cada fila de este conjunto de datos muestra un registro de medición por hora de uno de los cinco siguientes contaminantes del aire: NO, NO2, NOX, PM10 y PM2,5. Los datos se recopilaron en una ubicación de Londres durante todo el año 2017. Lea los datos con Pandas y realice las siguientes tareas.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

air_df = pd.read_csv('LaqnData.csv')
air_df

      Site Species   ReadingDateTime  Value   Units Provisional or Ratified
0      CT3      NO  01/01/2017 00:00    3.5  ug m-3                       R
1      CT3      NO  01/01/2017 01:00    3.6  ug m-3                       R
2      CT3      NO  01/01/2017 02:00    2.2  ug m-3                       R
3      CT3      NO  01/01/2017 03:00    2.1  ug m-3                       R
4      CT3      NO  01/01/2017 04:00    3.3  ug m-3                       R
...    ...     ...               ...    ...     ...                     ...
43795  CT3   PM2.5  31/12/2017 19:00   -2.0  ug m-3                       R
43796  CT3   PM2.5  31/12/2017 20:00    6.0  ug m-3                       R
43797  CT3   PM2.5  31/12/2017 21:00    5.0  ug m-3                       R
43798  CT3   PM2.5  31/12/2017 22:00    5.0  ug m-3                       R
43799  CT3   PM2.5  31/12/2017 23:00    6.0  ug m-3                       R

[43800 rows x 6 columns]

- El conjunto de datos tiene 6 columnas. Tres de ellas, llamadas 'Site','Units','Provisional or Ratified' no añaden ningún valor informativo, ya que son las mismas en todo el conjunto de datos. Utiliza el siguiente código para eliminarlas.

In [ ]:
air_df.drop(columns=['Site','Units','Provisional or Ratified'], inplace=True)

- El conjunto de datos está en formato largo. Aplica la función adecuada para cambiarlo al formato ancho. Nombra el DataFrame transformado, pvt_df.

- Dibuja y estudia el histograma y los diagramas de caja para las columnas de pvt_df.

# Ejercicio 5

Seguiremos trabajando con Law Data.csv.

- Ejecuta el siguiente código, observa su salida y luego estudia el código para responder qué hace cada línea de este código.

In [ ]:
import pandas as pd
air_df = pd.read_csv('LaqnData.csv')
air_df.drop(columns=['Site','Units','Provisional or Ratified'], inplace=True)
datetime_df = air_df.ReadingDateTime.str.split(' ',expand=True)
datetime_df.columns = ['Date','Time']
date_df = datetime_df.Date.str.split('/',expand=True)
date_df.columns = ['Day','Month','Year']
air_df = air_df.join(date_df).join(datetime_df.Time).drop(columns=['ReadingDateTime','Year'])
air_df

      Species  Value Day Month   Time
0          NO    3.5  01    01  00:00
1          NO    3.6  01    01  01:00
2          NO    2.2  01    01  02:00
3          NO    2.1  01    01  03:00
4          NO    3.3  01    01  04:00
...       ...    ...  ..   ...    ...
43795   PM2.5   -2.0  31    12  19:00
43796   PM2.5    6.0  31    12  20:00
43797   PM2.5    5.0  31    12  21:00
43798   PM2.5    5.0  31    12  22:00
43799   PM2.5    6.0  31    12  23:00

[43800 rows x 5 columns]

- Ejecuta el siguiente código, observa su salida y luego estudia el código para responder qué hace esta línea de código.

In [ ]:
air_df = air_df.set_index(['Month','Day','Time','Species'])
air_df

                         Value
Month Day Time  Species
01    01  00:00 NO         3.5
          01:00 NO         3.6
          02:00 NO         2.2
          03:00 NO         2.1
          04:00 NO         3.3
...                        ...
12    31  19:00 PM2.5     -2.0
          20:00 PM2.5      6.0
          21:00 PM2.5      5.0
          22:00 PM2.5      5.0
          23:00 PM2.5      6.0

[43800 rows x 1 columns]

- Ejecuta el siguiente código, observa su salida y luego estudia el código para responder qué hace esta línea de código.

In [ ]:
air_df.unstack()

                Value
Species            NO   NO2   NOX  PM10 PM2.5
Month Day Time
01    01  00:00   3.5  30.8  36.2  35.7   NaN
          01:00   3.6  31.5  37.0  28.5   NaN
          02:00   2.2  27.3  30.7  22.7   NaN
          03:00   2.1  23.5  26.8  20.5   NaN
          04:00   3.3  28.0  33.0  22.1   NaN
...               ...   ...   ...   ...   ...
12    31  19:00   0.7  17.5  18.5  16.3  -2.0
          20:00   0.7  17.5  18.6  14.5   6.0
          21:00   0.7  14.1  15.1   8.6   5.0
          22:00   1.1  22.0  23.6  12.5   5.0
          23:00   0.9  19.4  20.7  10.4   6.0

[8760 rows x 5 columns]

- Compara la salida del código anterior con pvt_df del Ejercicio 4. ¿Son básicamente iguales?

- Explica cuáles son las diferencias y similitudes entre el par .melt()/.pivot() y el par .stack()/.unstack()?

- Si tuvieras que elegir una contraparte para .melt() entre .stack()/.unstack() ¿cuál elegirías?